{
  "backend/main.mo": "Main actor implementing voter management system with role-based access control (Admin/Supervisor/Karyakarta), task management, user profiles, and blob storage for photos/documents; includes migration support and authorization mixins.",
  "backend/migration.mo": "Migration module that transforms old voter records with required fields to new voter records where most fields (except srNo, name, voterId) are optional, preserving existing data by wrapping values in Option types.",
  "feature_evidence.json": "Feature evidence report documenting three requirements to make VoterEntryForm fields optional except Name and Voter ID, remove validation rules from optional fields, and verify House Number is optional.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components showing VoterEntryForm with only Name and Voter ID required, all other fields optional but visible, with proper handling of optional/undefined values throughout the application.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables including primary color set to #002080 (--primary: 0.205 0 0).",
  "frontend/index.html": "HTML entry point for the Voter Management System React application with viewport meta tag and root div mounting point.",
  "frontend/src/App.tsx": "Main application component with Internet Identity authentication, profile setup flow, routing between pages (Dashboard, VoterEntry, VoterList, LabelPrinting, TaskManagement, Analytics), 30-second profile loading timeout with retry logic, and responsive navigation with #002080 header styling.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-screen access denied component displaying error message with shield icon, user's principal ID, and logout button for unauthorized users.",
  "frontend/src/components/AdvancedSearchFilters.tsx": "Provides a comprehensive search and filter UI for voters with text search fields (name, mobile, house number, voter ID) and dropdown filters (gender, caste, area, taluka, district, state). Applies filters reactively and displays active filter count with a clear-all option.",
  "frontend/src/components/CreateTaskForm.tsx": "A dialog form for creating and assigning tasks with title, description, deadline, role assignment (supervisor/karyakarta based on user permissions), and multiple file attachments with upload progress tracking. Uses react-hook-form for validation and mutation hooks for submission.",
  "frontend/src/components/DistributionChart.tsx": "Renders either a bar chart or pie chart using recharts to visualize distribution data with labels, values, and percentages. Includes custom tooltips and a color-coded legend with support for empty state.",
  "frontend/src/components/DocumentUploadField.tsx": "A reusable document upload component supporting multiple PDF and JPEG files up to 10MB each, with upload progress tracking, file type validation, preview icons, and remove functionality. Uses ExternalBlob for file handling.",
  "frontend/src/components/ImageUploadField.tsx": "A single-image upload component for JPEG files up to 5MB with preview, upload progress bar, and remove functionality. Uses ExternalBlob with progress callbacks and displays validation errors via toast notifications.",
  "frontend/src/components/LabelPrintView.tsx": "Dialog component for previewing and printing voter address labels in a 2-column grid layout, with 10 labels per page and print-specific CSS styling.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity authentication, toggling between login and logout states with loading indicators.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and role (Admin/Supervisor/Karyakarta) with form validation.",
  "frontend/src/components/TaskDetailModal.tsx": "Modal displaying full task details including title, description, assigned role, deadline, status badge, status updater, and downloadable attachments.",
  "frontend/src/components/TaskStatusBadge.tsx": "Badge component that displays task status (Pending/In Progress/Completed) with color-coded styling.",
  "frontend/src/components/TaskStatusUpdater.tsx": "Dropdown component for updating task status, only visible to users assigned to the task based on their role.",
  "frontend/src/components/TaskTable.tsx": "Table component displaying tasks with columns for title, description, assigned role, deadline, status badge, and attachment count; rows are clickable.",
  "frontend/src/components/VoterDetailModal.tsx": "Modal displaying comprehensive voter information including photo, signature, personal details, address, contact info, occupation, and downloadable educational documents.",
  "frontend/src/components/VoterEntryForm.tsx": "React form component for adding new voters with personal information, contact details, and file uploads (photo, signature, documents). Uses react-hook-form for validation and submits data via useAddVoter hook.",
  "frontend/src/components/VoterImportDialog.tsx": "Dialog component for bulk importing voters from CSV/Excel files. Parses uploaded files, checks for duplicates against existing voters, and displays import progress with success/error reporting.",
  "frontend/src/components/VoterTable.tsx": "Table component that displays voter records with columns for serial number, name, house number, voter ID, mobile, area, taluka, gender, and caste. Includes defensive checks for empty or invalid data.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication via Internet Identity. Handles actor creation, initialization with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAddVoter.ts": "React Query mutation hook for adding a new voter to the backend. Converts form data to backend format, handles gender enum mapping, and invalidates voter queries on success.",
  "frontend/src/hooks/useAssignTask.ts": "React Query mutation hook for assigning tasks to users by role. Accepts task details including title, description, deadline, assignee role, and attachments, then invalidates task queries on success.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile with stuck-state detection and automatic re-initialization. Includes timeout handling and retry logic for failed profile fetches.",
  "frontend/src/hooks/useGetTasks.ts": "React Query hook for fetching all tasks from the backend. Waits for actor initialization before enabling the query.",
  "frontend/src/hooks/useGetVoters.ts": "React Query hook for fetching all voter records with extensive debug logging. Handles actor initialization state and includes retry logic with combined loading state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "React Query mutation hook that saves the current user's profile via the backend actor and invalidates the user profile cache on success.",
  "frontend/src/hooks/useUpdateTaskStatus.ts": "React Query mutation hook that updates a task's status by ID and invalidates the tasks cache on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining colors for UI components like primary, secondary, destructive, success, and warning.",
  "frontend/src/main.tsx": "Application entry point that renders the root component wrapped with QueryClientProvider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/Analytics.tsx": "Analytics dashboard page that fetches voter data and displays distribution charts for gender, caste, education, office, and area demographics with loading and error states.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page displaying voter statistics including total, male, female, and other voters with percentage breakdowns, loading skeletons, and error handling with retry functionality.",
  "frontend/src/pages/LabelPrinting.tsx": "Label printing page that generates printable voter address labels formatted for A4 paper with 10 labels per page, including print preview and print functionality.",
  "frontend/src/pages/TaskManagement.tsx": "Task management page with role-based task filtering (Admin, Supervisor, Karyakarta), task creation form, task detail modal, and task table display with appropriate permissions.",
  "frontend/src/pages/VoterEntry.tsx": "Page component for adding new voters with a form header, icon, and card layout that renders the VoterEntryForm component.",
  "frontend/src/pages/VoterList.tsx": "Main voter list page with search filters, export/import CSV functionality, print labels feature, and a table displaying voters with loading/error states and action buttons.",
  "frontend/src/utils/excelExport.ts": "Utility function to export voter data to CSV format with proper escaping, UTF-8 BOM for Excel compatibility, and automatic download with timestamped filename.",
  "frontend/src/utils/excelImport.ts": "CSV parser that reads voter data from uploaded files, handles quoted fields and special characters, validates required fields, and converts data to ParsedVoter objects with proper type conversions.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities for extracting query parameters from both regular and hash-based routing, with sessionStorage persistence and cleanup functions for managing parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (primary blue #002080), HSL-based theme variables, extended border radius utilities, and plugins for animations and typography.",
  "project_state.json": "Project metadata documenting the election voter management system architecture, including Internet Identity authentication, role-based access, incremental development phases, known platform limitations (no SMS/OTP), and existing features with their implementation status."
}