{
  "backend/main.mo": "Main backend actor implementing voter management system with role-based access control (Admin/Supervisor/Karyakarta), user profiles, voter CRUD operations with blob storage for photos/documents, task management with attachments, and CSV import/export functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including components, pages, hooks, and styling with detailed descriptions of authentication flow, voter management UI, and data handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining CSS variables for light and dark themes including primary, secondary, destructive, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Voter Management System application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component with TanStack Router setup, authentication flow management with 30-second timeout, profile setup modal, access control, and responsive navigation for Dashboard, Voter Entry, Voter List, Label Printing, Task Management, and Analytics pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-screen component displaying access denied message with user principal ID and logout button for unauthorized users.",
  "frontend/src/components/AdvancedSearchFilters.tsx": "Advanced search and filter component for voters with text search fields (name, mobile, house number, voter ID) and dropdown filters (gender, caste, area, taluka, district, state) with clear filters functionality.",
  "frontend/src/components/CreateTaskForm.tsx": "A dialog form component for creating and assigning tasks with title, description, deadline, role selection, and file attachment support with upload progress tracking.",
  "frontend/src/components/DistributionChart.tsx": "A reusable chart component that renders either bar or pie charts using recharts library to display distribution data with labels, values, and percentages.",
  "frontend/src/components/DocumentUploadField.tsx": "A form field component for uploading multiple PDF or JPEG documents with file validation, progress tracking, preview icons, and removal functionality.",
  "frontend/src/components/ImageUploadField.tsx": "A form field component for uploading a single JPEG image with file size validation, upload progress tracking, preview display, and removal capability.",
  "frontend/src/components/LabelPrintView.tsx": "A dialog component that displays voter information in a printable label format, organizing 10 labels per page in a 2-column grid with print-specific CSS styling.",
  "frontend/src/components/LoginButton.tsx": "An authentication button component that handles Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup with name and role selection (Admin/Supervisor/Karyakarta). Prevents dismissal until profile is created using useSaveCallerUserProfile hook.",
  "frontend/src/components/TaskDetailModal.tsx": "Modal displaying detailed task information including title, description, assigned role, deadline, status badge, and downloadable attachments. Includes TaskStatusUpdater component for status changes.",
  "frontend/src/components/TaskStatusBadge.tsx": "Simple badge component that renders color-coded status indicators (yellow for Pending, blue for In Progress, green for Completed) based on TaskStatus enum.",
  "frontend/src/components/TaskStatusUpdater.tsx": "Dropdown component allowing assigned users to update task status (Pending/In Progress/Completed). Only visible to users whose role matches the task's assignedTo field.",
  "frontend/src/components/TaskTable.tsx": "Table component displaying tasks with columns for title, description, assigned role, deadline, status badge, and attachment count. Rows are clickable to open task details.",
  "frontend/src/components/VoterDetailModal.tsx": "Modal displaying comprehensive voter information including photo, signature, personal details, contact info, and downloadable educational documents in a scrollable layout.",
  "frontend/src/components/VoterEntryForm.tsx": "Form component for adding new voters with fields for personal info, address, contact details, and file uploads (photo, signature, documents). Uses react-hook-form for validation and useAddVoter hook for submission.",
  "frontend/src/components/VoterImportDialog.tsx": "Dialog component for importing voters from CSV/Excel files, parsing the file, checking for duplicates, and adding new voters with progress tracking and error reporting.",
  "frontend/src/components/VoterTable.tsx": "Table component that displays voter data with columns for serial number, name, house number, voter ID, mobile, area, taluka, gender, and caste, with defensive checks for empty data.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useAddVoter.ts": "Mutation hook for adding a new voter to the backend with comprehensive voter details including personal info, documents, and photos, invalidating the voters query on success.",
  "frontend/src/hooks/useAssignTask.ts": "Mutation hook for assigning tasks with title, description, deadline, role assignment, and attachments, invalidating the tasks query on success.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current authenticated user's profile with detailed logging, custom loading states, and error handling that accounts for actor initialization.",
  "frontend/src/hooks/useGetTasks.ts": "Query hook that fetches all tasks from the backend, enabled only when the actor is available and not fetching.",
  "frontend/src/hooks/useGetVoters.ts": "Query hook that fetches all voters from the backend with extensive debug logging, retry logic, and combined loading state that accounts for actor initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useSaveCallerUserProfile.ts": "Mutation hook for saving the current user's profile to the backend, invalidating the user profile query on success.",
  "frontend/src/hooks/useUpdateTaskStatus.ts": "Mutation hook for updating a task's status by task ID, invalidating the tasks query on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, including primary, secondary, destructive, success, and warning color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/Analytics.tsx": "Displays an analytics dashboard with distribution charts for voter demographics (gender, caste, education, office, area). Fetches voter data and processes it into chart-ready format with percentages.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing voter statistics cards (total, male, female, other voters) with percentages. Includes loading states, error handling with retry functionality, and uses the useGetVoters hook.",
  "frontend/src/pages/LabelPrinting.tsx": "Provides a print-friendly view for generating voter address labels on A4 paper, displaying 10 labels per page. Includes print preview and handles pagination for multiple voters.",
  "frontend/src/pages/TaskManagement.tsx": "Task management interface with role-based filtering (Admin sees all, Supervisor sees assigned/created, Karyakarta sees assigned only). Includes task creation form and detail modal with permission checks.",
  "frontend/src/pages/VoterEntry.tsx": "Simple page wrapper for the VoterEntryForm component, providing a card layout with header and description for adding new voters to the system.",
  "frontend/src/pages/VoterList.tsx": "Comprehensive voter list page with advanced search/filtering, CSV import/export functionality, label printing, and a data table. Includes error handling and action buttons for data management.",
  "frontend/src/utils/excelExport.ts": "Utility function to export voter data to CSV format with proper field escaping, UTF-8 BOM for Excel compatibility, and automatic filename generation with current date.",
  "frontend/src/utils/excelImport.ts": "Parses CSV files containing voter data, handling quoted fields and converting rows into ParsedVoter objects with validation for required fields (Name, Voter ID) and type conversion for gender and house numbers.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence support and methods to clear sensitive parameters from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme with HSL variables for theming, border radius utilities, and includes tailwindcss-animate and typography plugins.",
  "project_state.json": "Project state document tracking an election voter management system with Internet Identity auth, role-based access, and known issues including navigation menu disappearance and agent initialization errors blocking application access after login."
}