{
  "kind": "build_request",
  "title": "Fix 'Detected both agent and agentOptions' error blocking actor initialization after Internet Identity login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-85",
      "text": "Fix the 'Detected both agent and agentOptions passed to createActor' error in the useActor hook (frontend/src/hooks/useActor.ts) by ensuring that only the agent parameter is passed to createActor, not both agent and agentOptions simultaneously. Remove or restructure the conflicting configuration that causes this initialization error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Detected both agent and agentOptions passed to createActor. Ignoring agentOptions and proceeding with the provided agent.",
          "[App] Stage: Initializing actor Object",
          "[App] Stage: Waiting for actor"
        ]
      },
      "acceptanceCriteria": [
        "The 'Detected both agent and agentOptions' console error no longer appears after Internet Identity login",
        "The useActor hook successfully initializes the backend actor without conflicts",
        "Actor initialization completes and transitions from 'Initializing actor' to 'Waiting for actor' to 'Actor ready' without hanging"
      ]
    },
    {
      "id": "REQ-86",
      "text": "Add defensive error handling to the useActor hook (frontend/src/hooks/useActor.ts) to catch actor initialization failures and return clear error states. Ensure that if createActor throws an error or fails, the error is logged with timestamp and the actor state reflects the failure instead of hanging indefinitely.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Stage: Waiting for actor",
          "Authentication timeout"
        ]
      },
      "acceptanceCriteria": [
        "Actor initialization errors are caught and logged to console with descriptive messages",
        "The useActor hook returns an error state when initialization fails",
        "The authentication flow does not hang indefinitely when actor creation fails"
      ]
    },
    {
      "id": "REQ-87",
      "text": "Verify that the actor initialization properly completes after Internet Identity login by ensuring the authentication flow in frontend/src/App.tsx transitions through all states correctly: authenticated -> initializing actor -> actor ready -> loading profile -> profile loaded. Add console logging to confirm each state transition occurs without hanging at 'Waiting for actor'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "[App] Stage: Initializing actor Object",
          "[App] Stage: Waiting for actor"
        ]
      },
      "acceptanceCriteria": [
        "Console logs show the complete authentication state sequence without gaps",
        "The application successfully transitions from 'Waiting for actor' to 'Actor ready' within 10 seconds",
        "Profile loading begins immediately after actor initialization completes",
        "The Dashboard or Profile Setup page displays after successful authentication"
      ]
    }
  ],
  "constraints": [
    "Do not modify the Internet Identity authentication integration in frontend/src/hooks/useInternetIdentity.ts",
    "Maintain the existing 30-second timeout mechanism already implemented in frontend/src/App.tsx",
    "Preserve the existing React Query configuration and query invalidation logic"
  ],
  "nonGoals": [
    "Changing the Internet Identity authentication provider or login flow",
    "Modifying backend canister methods or actor interface definitions",
    "Adding new authentication features or alternative login methods"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}