{
  "kind": "build_request",
  "title": "Restore missing main navigation menu after Version 15 deployment",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-66",
      "text": "Restore the main navigation menu in frontend/src/App.tsx that displays menu items (Dashboard, Add Voter, Voter List, Label Printing, Task Management, Analytics) for both mobile and desktop views. The navigation menu disappeared after Version 15 deployment while the header with 'Voter Management System' title and logout button remain visible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "menu bar is missing from both mobile and desktop view",
          "1 yes main menu 2 yes it worked before last deployment 3 yes header and logout is visible"
        ]
      },
      "acceptanceCriteria": [
        "Main navigation menu is visible on both mobile and desktop views",
        "Menu displays all items: Dashboard, Add Voter, Voter List, Label Printing, Task Management, and Analytics",
        "Navigation menu appears below or alongside the header with 'Voter Management System' title",
        "Logout button remains visible and functional",
        "Navigation links route correctly to their respective pages"
      ]
    },
    {
      "id": "REQ-67",
      "text": "Verify that the navigation menu rendering logic in frontend/src/App.tsx was not accidentally removed or conditionally hidden during the Version 15 deployment. Check for any CSS classes, conditional rendering, or display properties that may be causing the menu to be hidden.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "it worked before last deployment"
        ]
      },
      "acceptanceCriteria": [
        "Navigation menu JSX elements are present in the App.tsx component",
        "No CSS classes with display:none or visibility:hidden are applied to navigation elements",
        "Conditional rendering logic does not prevent menu from displaying when user is authenticated",
        "Navigation menu is not positioned off-screen or with zero height/width"
      ]
    }
  ],
  "constraints": [
    "Do not modify the Internet Identity authentication logic in frontend/src/hooks/useInternetIdentity.ts",
    "Keep the header with 'Voter Management System' title and logout button visible and functional",
    "Maintain the existing dark blue (#002080) color scheme for header and buttons",
    "Ensure navigation menu works with the existing TanStack Router setup"
  ],
  "nonGoals": [
    "Adding new navigation menu items beyond the six existing ones",
    "Redesigning the navigation menu layout or styling",
    "Modifying the logout button behavior or appearance",
    "Changing the header text or responsive sizing"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}