{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 'Detected both agent and agentOptions' error blocking actor initialization after Internet Identity login",
  "requirements": [
    {
      "id": "REQ-85",
      "summary": "Fix the 'Detected both agent and agentOptions' error in useActor hook by ensuring only the agent parameter is passed to createActor",
      "acceptanceCriteria": [
        "The 'Detected both agent and agentOptions' console error no longer appears after Internet Identity login",
        "The useActor hook successfully initializes the backend actor without conflicts",
        "Actor initialization completes and transitions from 'Initializing actor' to 'Waiting for actor' to 'Actor ready' without hanging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Remove the conflicting agentOptions parameter from the createActor call. Ensure that when an authenticated agent is available from Internet Identity, only the agent parameter is passed to createActor, not both agent and agentOptions simultaneously. The hook should check if an agent exists and pass it exclusively, or fall back to agentOptions only when no agent is present (anonymous case)."
        }
      ]
    },
    {
      "id": "REQ-86",
      "summary": "Add defensive error handling to the useActor hook to catch actor initialization failures and return clear error states",
      "acceptanceCriteria": [
        "Actor initialization errors are caught and logged to console with descriptive messages",
        "The useActor hook returns an error state when initialization fails",
        "The authentication flow does not hang indefinitely when actor creation fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Wrap the createActor call in a try-catch block to handle initialization errors gracefully. Log any errors to console with timestamps and descriptive messages. Return an error state from the hook that consumers can check. Ensure that if createActor throws an error or fails, the error is surfaced to the component layer instead of leaving the actor in an indefinite 'Waiting for actor' state."
        }
      ]
    },
    {
      "id": "REQ-87",
      "summary": "Verify that the actor initialization properly completes after Internet Identity login by ensuring the authentication flow transitions through all states correctly",
      "acceptanceCriteria": [
        "Console logs show the complete authentication state sequence without gaps",
        "The application successfully transitions from 'Waiting for actor' to 'Actor ready' within 10 seconds",
        "Profile loading begins immediately after actor initialization completes",
        "The Dashboard or Profile Setup page displays after successful authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add comprehensive console logging to track the authentication state sequence: authenticated -> initializing actor -> actor ready -> loading profile -> profile loaded. Ensure the existing stage tracking includes timestamps for each transition. Verify that the actor error state from useActor is checked and handled appropriately in the authentication flow, preventing indefinite hangs at 'Waiting for actor'. Preserve the existing 30-second timeout mechanism already implemented."
        },
        {
          "path": "frontend/src/hooks/useGetCallerUserProfile.ts",
          "operation": "modify",
          "description": "Add console logging at the start and end of the profile fetch operation to confirm when profile loading begins and completes. Log the actor availability state and any errors that occur during profile fetching. Ensure the hook properly reflects the actor dependency state so that profile loading only starts after actor initialization is complete."
        }
      ]
    }
  ]
}